//Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

bull Palindrom (int x)

Console.WriteLine("Введите число: ");



