// Задача 29: 
// Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

void Array[]
{
    int [] array = new array [numbers]
    for (int i = 0; i < Array.Length; i++)

    array[i] = 
}




Console.Write("Input number: ");

int a = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Your array is: " + a );